//=============================================================================
//
// 入力処理 [input.h]
// Author : 荒谷 由朗
//
//=============================================================================
#ifndef _INPUT_H_
#define _INPUT_H_

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"

//=============================================================================
// プロトタイプ宣言
//=============================================================================
HRESULT InitKeyboard		(HINSTANCE hInstance, HWND hWnd);
void	UninitKeyboard		(void);
void	UpdateKeyboard		(void);
bool	GetKeyboardPress	(int Key);		// キーボードプレス
bool	GetKeyboardTrigger	(int Key);		// キーボードトリガー
bool	GetKeyboardRelease	(int Key);		// キーボードリリース
#endif