//=============================================================================
//
// メッシュフィールド処理 [meshField.h]
// Author : 荒谷由朗
//
//=============================================================================
#ifndef _MESHFIELD_H_
#define _MESHFIELD_H_

#include "main.h"

//=============================================================================
// 構造体
//=============================================================================
typedef struct
{
	D3DXMATRIX	mtxWorld;	// ワールドマトリックス
	D3DXVECTOR3 pos;		// 位置(中心座標)
	D3DXVECTOR3 rot;		// 向き
	D3DXCOLOR	col;		// 色
	bool		bUse;		// 使用しているかどうか
}MeshField;

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitMeshField		(void);
void UninitMeshField	(void);
void UpdateMeshField	(void);
void DrawMeshField		(void);
#endif