//=============================================================================
//
//	オブジェクトのライフゲージの処理 [ObjectLife.h]
// Author : 荒谷由朗
//
//=============================================================================
#ifndef _OBJECTLIFE_H_
#define _OBJECTLIFE_H_

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitOBLife(void);
void UninitOBLife(void);
void UpdateOBLife(void);
void DrawOBLife(void);
float GetOBLife(void);
#endif
