//***************************************************************************//
//
// リザルト処理 [result.h]
// Author : 荒谷由朗
//
//***************************************************************************//
#ifndef _RESULT_H_
#define _RESULT_H_

#include "main.h"

//***************************************************************************//
// プロトタイプ宣言(Result)
//***************************************************************************//
void InitResult(void);
void UninitResult(void);
void UpdateResult(void);
void DrawResult(void);

#endif