//=============================================================================
//
// タイトル処理 [title.cpp]
// Author :		荒谷由朗
//
//=============================================================================
#include "fade.h"		// ←"texture.h"で使っているので消さない
#include "title.h"
#include "manager.h"
#include "input.h"
#include "sound.h"
#include "texture.h"
#include "MeshField.h"
#include "object.h"
#include "wall.h"
#include "object.h"

//=============================================================================
// 静的メンバ変数
//=============================================================================
CWall			*CTitle::m_pWall	= NULL;
CObject			*CTitle::m_pObject	= NULL;
CTitle::TYPE	CTitle::m_pType		= TYPE_NONE;

//=============================================================================
//　コンストラクタ
//=============================================================================
CTitle::CTitle()
{
	m_pType = TYPE_NONE;
}

//=============================================================================
//　デストラクタ
//=============================================================================
CTitle::~CTitle()
{

}

//=============================================================================
//　初期化処理
//=============================================================================
HRESULT CTitle::Init(void)
{
	//===================================
	// ロード
	//===================================
	// UIの読み込み
	CTexture::Load();

	// 壁のテクスチャの読み込み
	m_pWall->Load();

	//オブジェクトのテクスチャの読み込み
	m_pObject->Load();

	//===================================
	// 生成
	//===================================
	SetTex();		 // UI
	SetFloor();		 // 床
	SetWall();		 // 壁
	SetObje();		 // オブジェクト

	// サウンドの生成
	CSound *pSound = CManager::GetSound();
	pSound->PlaySound(CSound::SOUND_LABEL_BGM_TITLE);

	return S_OK;
}

//=============================================================================
//　終了処理
//=============================================================================
void CTitle::Uninit(void)
{
	CTexture::UnLoad();		// テクスチャ

	// フェード以外削除
	CScene::NotFadeReleseAll();

	// サウンドの削除
	CSound *pSound = CManager::GetSound();
	if (pSound != NULL)
	{
		pSound->AllStopSound();
	}
}

//=============================================================================
//　更新処理
//=============================================================================
void CTitle::Update(void)
{
	CInputKeyBoard	*pKey	= CManager::GetInputKeyboard();		// 入力情報の取得
	CInputMouse		*pMouse = CManager::GetInputMouse();		// 入力情報の取得(マウス)

	if (pKey != NULL)
	{
		if (pKey->GetKeyboardPress(DIK_RETURN) == true || pMouse->GetMouseTrigger(0) == true)
		{// マウスクリックしたとき
			m_pType = TYPE_PRESS;	// PRESS状態にする
			CSound *pSound = CManager::GetSound();
			pSound->PlaySound(CSound::SOUND_LABEL_SE_PAUSE_DECISION);
		}
	}
}

//=============================================================================
//　描画処理
//=============================================================================
void CTitle::Draw(void)
{
}

//=============================================================================
//　テクスチャの生成
//=============================================================================
void CTitle::SetTex(void)
{
	CTexture::Create(D3DXVECTOR3((SCREEN_WIDTH / 2), 180.0f, 0.0f), D3DXVECTOR2(350.0f, 150.0f), 0);	// タイトルロゴ(左)
	CTexture::Create(D3DXVECTOR3((SCREEN_WIDTH / 2), 180.0f, 0.0f), D3DXVECTOR2(350.0f, 150.0f), 1);	// タイトルロゴ(右)
	CTexture::Create(D3DXVECTOR3((SCREEN_WIDTH / 2), 650.0f, 0.0f), D3DXVECTOR2(170.0f, 40.0f), 2);		// PRESS背景
	CTexture::Create(D3DXVECTOR3((SCREEN_WIDTH / 2), 650.0f, 0.0f), D3DXVECTOR2(150.0f, 20.0f), 3);		// PRESS
}

//=============================================================================
//　床の生成
//=============================================================================
void CTitle::SetFloor(void)
{// CMeshField::Create(座標、サイズ、分割数)
	CMeshField::Create(D3DXVECTOR3(-5000.0f, 0.0f, 5000.0f), 10000.0f, 10000.0f, 100, 100);	// Create(座標、サイズ、分割数)
}

//=============================================================================
//　壁の生成
//=============================================================================
void CTitle::SetWall(void)
{
}

//=============================================================================
//　オブジェクトの生成
//=============================================================================
void CTitle::SetObje(void)
{// CObject::Create( 座標 , 移動量 , 使用する画像の番号 , 生成するオブジェクトの番号 , オブジェクトのタイプ , 当たり判定の有無 );
	// クリスタル
	CObject::Create(D3DXVECTOR3(0.0f, 0.0f, 0.0f), 0.0f, 2, 2, CObject::MOVETYPE_NOT, 0);
}