//=============================================================================
//
// チュートリアル処理 [tutoriaru.h]
// Author : 荒谷 由朗
//
//=============================================================================
#ifndef _TUTORIARU_H_
#define _TUTORIARU_H_

#include "main.h"

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitTutoriaru		(void);
void UninitTutoriaru	(void);
void UpdateTutoriaru	(void);
void DrawTutoriaru		(void);
#endif